RailsUdemyCurso/Modulo02_Crypto/app/controllers/coins_controller.rb

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", ""], ["created_at", "2022-01-20 17:57:13.689461"], ["updated_at", "2022-01-20 17:57:13.689461"]]
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "description" = ?, "acronym" = ?, "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["description", "Dodge"], ["acronym", "D"], ["url_image", "https://cdn.icon-icons.com/icons2/278/PNG/512/DogeCoin_30203.png"], ["updated_at", "2022-02-16 14:04:08.643482"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 3]]
---
  def destroy
    @coin.destroy

SELECT "mining_types"."description", "mining_types"."acronym" FROM "mining_types"
---
  def set_mining_type_options
    @mining_type_options = MiningType.all.pluck(:description, :acronym)